bench/configs/accuracy.yaml
# Accuracy-suite bench config: one deployed gateway, three scoreboard columns
# (a single model and two orchestration tiers), judge served by the same
# gateway. Run with:
#
#   kairyu bench run --config bench/configs/accuracy.yaml
#
# CLI flags override any field here (e.g. --smoke, --limit 50).
suite: accuracy

# Generated-code execution is part of the run fingerprint. `local` is for
# trusted development only. For unattended LiveCodeBench/SciCode, build
# deploy/bench/Dockerfile.exec and replace the placeholder with its immutable
# `docker image inspect ... --format '{{.Id}}'` result.
execution:
  runner: local
# execution:
#   runner: docker
#   image: sha256:0000000000000000000000000000000000000000000000000000000000000000
#   cpus: 1.0
#   pids_limit: 64
#   disk_mb: 256

targets:
  - name: llama-70b          # scoreboard column label
    base_url: http://localhost:8000/v1
    model: m1                # a served engine/pool name
  - name: kairyu-auto
    base_url: http://localhost:8000/v1
    model: kairyu-auto       # orchestration = just another model name
  - name: kairyu-auto-max
    base_url: http://localhost:8000/v1
    model: kairyu-auto-max

# Sampling policy belongs to the endpoint and applies to every chat slot. Fugu
# reports its table at each model's maximum reasoning effort, so set the
# endpoint-supported equivalent under each target rather than per benchmark.
# Choose either an explicit temperature or recommended mode, never both:
#
#   reasoning_effort: high  # only when the endpoint implements this field
#   temperature: 0.6        # overrides the adapter-authored temperature
#   top_p: 0.95
#   seed: 100               # with attempts=4, request seeds are 100..103
#   # Native Kairyu Qwen3 uses this instead of reasoning_effort:
#   extra_body_json: '{"chat_template_kwargs": {"enable_thinking": true}}'
#
# Or omit generation-default fields so the endpoint may apply its model
# generation_config:
#
#   sampling_mode: recommended
#
# Recommended mode is request intent, not remote attestation that the endpoint
# loaded particular defaults. Bind the expected deployment with served_config.
# Explicit temperature and recommended mode are chat-only. SWE-Bench Pro,
# SWE-bench Verified, Terminal-Bench, and tau-bench-banking fail closed as
# skipped under either; exclude those rows for this run and run them separately
# with the default target policy. Both SWE-bench rows require attempts=1.

# LLM judge for free-form grading (HLE, CharXiv) and the tau-bench user
# simulator. Pointing it at the deployed gateway keeps judging self-hosted;
# the judge model is disclosed in every scoreboard's methodology.
judge:
  base_url: http://localhost:8000/v1
  model: kairyu-auto
  # Fugu ran its tau-3 user simulator at low effort. For native Kairyu Qwen3:
  # extra_body_json: '{"chat_template_kwargs": {"enable_thinking": false}}'

# limit: 50                  # optional: cap items per benchmark
# smoke: true                # tiny deterministic subset (CI)
# seed: 0                    # item selection, not the target request seed
# attempts: 4                # grouped chat sweep; unset target seed gives 0..3
# exclude: [swe-bench-pro, swe-bench-verified, terminal-bench, tau-bench-banking]  # chat-only
concurrency: 16
# results_dir: bench/results/accuracy
# cache_dir: ~/.cache/kairyu/benchmarks   # or $KAIRYU_BENCH_CACHE